; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared1 - mode
	infrared0 - mode
	thermograph2 - mode
	Star3 - direction
	GroundStation5 - direction
	Star10 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation4 - direction
	Star9 - direction
	Star8 - direction
	GroundStation6 - direction
	Star1 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star10)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star8)
	(calibration_target instrument4 Star9)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
)
(:goal (and
	(pointing satellite0 Star1)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 infrared0)
	(have_image Star13 infrared1)
	(have_image Planet14 infrared0)
	(have_image Star15 infrared1)
	(have_image Star16 thermograph2)
	(have_image Planet17 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation4 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 planet14 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet14)
   goals met: 0 of 8
5. (take_image satellite1 planet14 instrument3 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 1 of 8
6. (turn_to satellite1 planet11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet11)
   goals met: 1 of 8
7. (take_image satellite1 planet11 instrument3 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 8
9. (turn_to satellite0 star1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star1)
   goals met: 3 of 8
10. (take_image satellite1 phenomenon12 instrument3 infrared0)
   added: (have_image phenomenon12 infrared0)
   goals met: 4 of 8
11. (turn_to satellite1 planet17 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet17)
   goals met: 4 of 8
12. (take_image satellite1 planet17 instrument3 infrared0)
   added: (have_image planet17 infrared0)
   goals met: 5 of 8
13. (turn_to satellite1 star13 planet17)
   deleted: (pointing satellite1 planet17)
   added: (pointing satellite1 star13)
   goals met: 5 of 8
14. (take_image satellite1 star13 instrument3 infrared1)
   added: (have_image star13 infrared1)
   goals met: 6 of 8
15. (turn_to satellite1 star15 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star15)
   goals met: 6 of 8
16. (take_image satellite1 star15 instrument3 infrared1)
   added: (have_image star15 infrared1)
   goals met: 7 of 8
17. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 7 of 8
18. (take_image satellite1 star16 instrument3 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 8 of 8
